<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;
use App\Models\Category;

class SeedCategoriesData extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {

        $categories =
        [
            [
                'name' => 'root', 'children' =>
                [

                    [
                        'name' => '泵', 'children' =>
                        [
                            ['name' => '潜水泵'],
                            ['name' => '离心泵'],
                            ['name' => '活塞泵'],
                            ['name' => '柱塞泵'],
                            ['name' => '隔膜泵'],
                            ['name' => '螺标泵'],
                            ['name' => '齿轮泵'],
                            ['name' => '真空泵'],
                            ['name' => '循环泵'],
                            ['name' => '冷凝泵'],
                            ['name' => '高压泵'],
                            ['name' => '计量泵'],
                            ['name' => '深井泵'],
                            ['name' => '排污泵'],
                            ['name' => '混流／轴流／涡流泵'],
                            ['name' => '提升泵'],
                            ['name' => '叶片泵'],
                            ['name' => '高温泵／磁力驱动泵'],
                            ['name' => '油桶泵／容积泵'],
                            ['name' => '润滑泵'],
                            ['name' => '气动泵'],
                            ['name' => '蠕动泵'],
                            ['name' => '液压泵／输送泵'],
                            ['name' => '自吸泵／电磁泵'],
                            ['name' => '单联／多联泵'],
                            ['name' => '低温泵'],
                            ['name' => '流体泵'],
                            ['name' => '定量泵／流量泵'],
                            ['name' => '偏心泵／软管泵'],
                        ]
                    ],
                    [
                        'name' => '阀', 'children' =>
                        [
                            ['name' => '方向阀'],
                            ['name' => '球阀／旋塞阀'],
                            ['name' => '闸阀／刀闸阀'],
                            ['name' => '蝶阀'],
                            ['name' => '隔膜阀'],
                            ['name' => '截止阀／止回阀／切断阀'],
                            ['name' => '针阀／活塞阀'],
                            ['name' => '减压阀／卸压阀／溢流阀'],
                            ['name' => '安全阀／切断阀'],
                            ['name' => '控制阀/调节阀'],
                            ['name' => '调压阀/调节器'],
                            ['name' => '阀门电动/气动/智能定位器'],
                            ['name' => '阀门气/电动执行器'],
                            ['name' => '顺序阀/分流阀/插装阀'],
                            ['name' => '电磁阀/比例阀'],
                            ['name' => '电动球阀/气动球阀'],
                            ['name' => '伺服阀/开关阀'],
                            ['name' => '先导阀/操纵阀'],
                            ['name' => '燃油关断/空气起动阀'],
                            ['name' => '进气阀/排气阀/分气阀'],
                            ['name' => '夹管阀/转盘/刀闸阀'],
                            ['name' => '阀门控制器'],
                            ['name' => '冲放/疏水阀'],
                            ['name' => '液压阀'],
                        ]
                    ],
                    [
                        'name' => '传感器','children' =>
                        [
                            ['name' => '压力传感器'],
                            ['name' => '压力/温度变送'],
                            ['name' => '距离传感器'],
                            ['name' => '超声波传感器'],
                            ['name' => '电感式传感器'],
                            ['name' => '防爆感应式传感器'],
                            ['name' => '液位传感器'],
                            ['name' => '转速探头'],
                            ['name' => '速度探头'],
                            ['name' => '脉冲传感器'],
                            ['name' => '热流传感器'],
                            ['name' => '加速度传感器 '],
                            ['name' => '接近传感器'],
                            ['name' => '温度传感器'],
                            ['name' => '称重传感器'],
                            ['name' => '位移传感器'],
                            ['name' => '阻挡器'],
                            ['name' => '终端位置传感器'],
                            ['name' => '分离器/分配器/发射控制器'],
                            ['name' => '气体传感器'],
                            ['name' => '振动传感/变送器'],
                            ['name' => '安全光幕'],
                            ['name' => '探头/加速计'],
                            ['name' => '安全传感器/可逆接触器'],
                            ['name' => '角度/倾斜传感器'],
                            ['name' => '光学/智能/颜色传感器'],
                            ['name' => '便携式传感器'],
                            ['name' => '雷达/电容/微波传感器'],
                            ['name' => '流量/水准传感器'],
                            ['name' => '激光传感器/线纱传感器'],
                            ['name' => '液位/压差变送器'],
                            ['name' => '涡流传感器'],
                            ['name' => '气体变送器'],
                            ['name' => '张力传感器'],
                            ['name' => '电流/电压传感器'],
                            ['name' => '电量传感器/电压互感器'],
                            ['name' => '光电传感器'],
                            ['name' => '扭矩传感器/测力传感器'],
                        ]
                    ],
                    [
                        'name' => '编码器','children' =>
                        [
                            ['name' => '绝对值编码器'],
                            ['name' => '旋转编码器'],
                            ['name' => '角度编码器'],
                            ['name' => '增量型编码器'],
                            ['name' => '速度编码器'],
                            ['name' => '防爆编码器'],
                            ['name' => '重载编码器'],
                            ['name' => '正余弦编码器'],
                            ['name' => '单多圈编码器'],
                            ['name' => '总线编码器'],
                            ['name' => '空心实心轴编码器'],
                            ['name' => '拉绳编码器'],
                            ['name' => '光电编码器 '],
                            ['name' => '组合编码器'],
                            ['name' => '脉冲编码器 '],
                        ]
                    ],
                    [
                        'name' => '过滤器','children' =>
                        [
                            ['name' => '空气过滤系统'],
                            ['name' => '过滤器/滤芯'],
                            ['name' => '干燥器/分离器 '],
                        ]
                    ],
                    [
                        'name' => '接头／联轴器／轴承／涨紧套','children' =>
                        [
                            ['name' => '快速接头'],
                            ['name' => '润滑系统/输油输脂设备'],
                            ['name' => '分油器'],
                            ['name' => '打油器/注油器'],
                            ['name' => '胀紧套'],
                            ['name' => '联轴器'],
                            ['name' => '齿轮轴'],
                            ['name' => '对轴耦合器'],
                            ['name' => '齿轮/平凸轮'],
                            ['name' => '拖链/轴承 '],
                        ]
                    ],
                    [
                        'name' => '仪器仪表','children' =>
                        [
                            ['name' => '泄漏检测仪器'],
                            ['name' => '测量系统'],
                            ['name' => '气体分析仪'],
                            ['name' => '气体探测器'],
                            ['name' => '气体测量仪'],
                            ['name' => '条形扫描仪'],
                            ['name' => '激光测距仪'],
                            ['name' => '测试/测量仪'],
                            ['name' => '平衡器/控制器'],
                            ['name' => '火焰检测器'],
                            ['name' => '质量控制器'],
                            ['name' => '电流表/电能表/统计仪'],
                            ['name' => '变送器/控制器'],
                            ['name' => '温/湿度检测器'],
                            ['name' => '减温/减压器'],
                            ['name' => '监测/监视器 '],
                            ['name' => '电磁振动器/震荡逆变器'],
                            ['name' => '酸度仪/浊度仪/水质监测分析仪'],
                            ['name' => '人机界面/触摸屏'],
                            ['name' => '分析/测量/测试仪'],
                            ['name' => '显示器/显示屏/数显表'],
                            ['name' => '检设备/探测器'],
                            ['name' => '激光仪/热像/成像仪'],
                            ['name' => '声器/播放器/放大器'],
                            ['name' => '压力/压差表'],
                            ['name' => '发生器/气体发生器'],
                            ['name' => '色谱/光谱仪'],
                            ['name' => '隔离器/中继器'],
                            ['name' => '调速器/软启动器'],
                            ['name' => '射仪/旋光仪/偏振计'],
                            ['name' => '震动器/振荡器 '],
                            ['name' => '投影/镜头'],
                            ['name' => '校正/校验仪器'],
                            ['name' => '欧姆计 '],
                        ]
                    ],
                    [
                        'name' => '流量仪表','children' =>
                        [
                            ['name' => '流量/流速指示器'],
                            ['name' => '料位计'],
                            ['name' => '流量计'],
                            ['name' => '液位计'],
                            ['name' => '压力计/温度计'],
                            ['name' => '硬度计'],
                            ['name' => '料位计/物位计'],
                            ['name' => '真空计'],
                            ['name' => '密度计'],
                            ['name' => '酸度计'],
                            ['name' => '定位计'],
                            ['name' => '粘度计/比重计'],
                            ['name' => '液位开关'],
                            ['name' => '转速计'],
                        ]
                    ],
                    [
                        'name' => '高低压电气','children' =>
                        [
                            ['name' => '变压器'],
                            ['name' => '绝缘检测仪'],
                            ['name' => '电流互感器'],
                            ['name' => '报警器'],
                            ['name' => '镇流器'],
                            ['name' => '变频器'],
                            ['name' => '软启动'],
                            ['name' => '电抗器'],
                        ]
                    ],
                    [
                        'name' => '电机／发动机／伺服系统／马达','children' =>
                        [
                            ['name' => '发动机'],
                            ['name' => '电机'],
                            ['name' => '伺服控制器'],
                            ['name' => '减速机'],
                            ['name' => '线性定位器/执行器'],
                            ['name' => '驱动器'],
                            ['name' => '通风机/搅拌机'],
                            ['name' => '压力机'],
                            ['name' => '制动器/离合器'],
                            ['name' => '齿轮马达/分流马达'],
                            ['name' => '齿轮箱'],
                            ['name' => '驱动马达/直流马达'],
                            ['name' => '振动器/振荡器'],
                            ['name' => '减速箱'],
                            ['name' => '发电机 '],
                        ]
                    ],
                    [
                        'name' => '换热器／冷却器／风机','children' =>
                        [
                            ['name' => '鼓风机'],
                            ['name' => '冷却器'],
                            ['name' => '热交换机'],
                            ['name' => '离心风机'],
                            ['name' => '轴流风机 '],
                            ['name' => '板式/壳管式/列管式换热器 '],
                            ['name' => '交换机/空调/加热器'],
                            ['name' => '风扇'],
                            ['name' => '油冷却器'],
                        ]
                    ],
                    [
                        'name' => '电气元件','children' =>
                        [
                            ['name' => '电源'],
                            ['name' => '开关'],
                            ['name' => '发射器/接收器/遥控器 '],
                            ['name' => '连接器/端子'],
                            ['name' => '计数器'],
                            ['name' => '继电器/整流器/断路器'],
                            ['name' => '热电偶/热电阻'],
                            ['name' => '熔断器/隔离开关'],
                            ['name' => '光纤卡/插卡'],
                            ['name' => '处理器/切断器'],
                            ['name' => '滤波/抗压器 '],
                            ['name' => '光源/灯泡/光纤'],
                            ['name' => '电路板'],
                            ['name' => '插头/插座/连接器'],
                        ]
                    ],
                    [
                        'name' => '液压元件','children' =>
                        [
                            ['name' => '液压缸'],
                            ['name' => '液压马达/柱塞马达'],
                            ['name' => '液压执行器'],
                            ['name' => '流体/液压配件'],
                            ['name' => '油压缓冲器'],
                            ['name' => '油缸/油压机'],
                            ['name' => '刹车离合器/制动/偶合器'],
                            ['name' => '油气弹簧/减振/减速器'],
                            ['name' => '液压软管/附件'],
                            ['name' => '接头/旋转接头'],
                            ['name' => '压缩机'],
                            ['name' => '分配器/配件'],
                            ['name' => '液压螺母'],
                            ['name' => '密封组件'],
                        ]
                    ],
                    [
                        'name' => '气动元件','children' =>
                        [
                            ['name' => '气动旋转接头'],
                            ['name' => '气缸/配件'],
                        ]
                    ],
                    [
                        'name' => '模块','children' =>
                        [
                            ['name' => '远程I/O模块'],
                            ['name' => '继电器模块'],
                            ['name' => '电源模块'],
                            ['name' => '监测模块'],
                            ['name' => '通讯模块'],
                            ['name' => '分频器模块'],
                            ['name' => '控制/输入/输出模块'],
                            ['name' => '隔离栅/安全栅'],
                            ['name' => '驱动/制动模块'],
                            ['name' => '扩展模块'],
                            ['name' => '光栅'],
                        ]
                    ],
                    [
                        'name' => '加湿加热设备','children' =>
                        [
                            ['name' => '加湿器 '],
                            ['name' => '鼓风/空气加热器'],
                            ['name' => '流体/浸入加热器'],
                            ['name' => '加热器/加热元件'],
                        ]
                    ],
                    [
                        'name' => '进口工具','children' =>
                        [
                            ['name' => '电动钻'],
                            ['name' => '扭矩扳手'],
                            ['name' => '磁力钻'],
                            ['name' => '电动推杆'],
                            ['name' => '电缆工具'],
                            ['name' => '机械夹具/夹紧螺母'],
                            ['name' => '各类刀具/测量/辅助工具'],
                            ['name' => '喷枪'],
                        ]
                    ],
                    [
                        'name' => '消防安全','children' =>
                        [
                            ['name' => '烟雾探测器'],
                            ['name' => '火焰探测器'],
                            ['name' => '气体报警装置'],
                        ]
                    ],
                ]
            ],
        ];


        Category::buildTree($categories);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        DB::table('categories')->truncate(); //清空表数据
    }
}
